## Imports

In [1]:
!pip install mysql-connector-python

import pandas as pd
import numpy as np
import os, time,json
import tmdbsimple as tmdb
from tqdm.notebook import tqdm_notebook
import matplotlib.pyplot as plt
import seaborn as sns
import matplotlib as mpl

import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy.types import *
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy import create_engine
import mysql.connector

import warnings
warnings.filterwarnings('ignore')

Requirement already satisfied: mysql-connector-python in c:\users\evan\anaconda3\envs\dojo-env\lib\site-packages (8.0.33)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in c:\users\evan\anaconda3\envs\dojo-env\lib\site-packages (from mysql-connector-python) (3.20.1)

## Load Data

### Basics

In [2]:
basics_df = pd.read_csv(r"C:\Users\Evan\Documents\GitHub\IMDB\Data\title_basics.csv.gz")

In [3]:
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013.0,NaN,120,"Drama,History"
2,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"

### Ratings

In [4]:
ratings_df = pd.read_csv('Data/title_ratings.csv.gz')
ratings_df.head(2)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1982
1  tt0000002            5.8       265

### TMDB

In [27]:
tmdb_df = pd.read_csv('Data/tmdb_results_combined.csv.gz')
tmdb_df.head(2)
tmdb_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2590 entries, 0 to 2589
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2590 non-null   object
 1   adult                  2588 non-null   float64
 2   backdrop_path          1420 non-null   object
 3   belongs_to_collection  210 non-null    object
 4   budget                 2588 non-null   float64
 5   genres                 2588 non-null   object
 6   homepage               171 non-null    object
 7   id                     2588 non-null   float64
 8   original_language      2588 non-null   object
 9   original_title         2588 non-null   object
 10  overview               2541 non-null   object
 11  popularity             2588 non-null   float64
 12  poster_path            2336 non-null   object
 13  production_companies   2588 non-null   object
 14  production_countries   2588 non-null   object
 15  release_date           2564 non-null   object
 16  revenue                2588 non-null   float64
 17  runtime                2588 non-null   float64
 18  spoken_languages       2588 non-null   object
 19  status                 2588 non-null   object
 20  tagline                1113 non-null   object
 21  title                  2588 non-null   object
 22  video                  2588 non-null   float64
 23  vote_average           2588 non-null   float64
 24  vote_count             2588 non-null   float64
 25  certification          813 non-null    object
dtypes: float64(9), object(17)
memory usage: 526.2+ KB

## Feature Columns

### title_basics
- Movie ID (tconst)
- Primary Title
- Start Year
- Runtime (in Minutes)
- Genres

In [6]:
basics_df = basics_df[['tconst', 'primaryTitle', 'startYear', 'endYear', 'runtimeMinutes',
                      'genres']]
basics_df.head(2)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0043139,Life of a Beijing Policeman,2013.0,NaN,120,"Drama,History"

### tmdb_results

- Movie ID (tconst)
- Revenue
- Budget
- Certification(MPAA Rating)

In [28]:
tmdb_df = tmdb_df[['imdb_id', 'budget', 'revenue', 'certification']]
tmdb_df

        imdb_id      budget     revenue certification
0             0         NaN         NaN           NaN
1     tt0113026  10000000.0         0.0           NaN
2     tt0113092         0.0         0.0           NaN
3     tt0116391         0.0         0.0           NaN
4     tt0118694    150000.0  14204632.0            PG
...         ...         ...         ...           ...
2585  tt7797790         0.0         0.0           NaN
2586  tt8665056         0.0         0.0           NaN
2587  tt8795764         0.0         0.0            NR
2588  tt9071078         0.0         0.0           NaN
2589  tt9212730         0.0         0.0           NaN

[2590 rows x 4 columns]

## Remove rows with empty data

In [30]:
tmdb_df.drop(0, axis = 'index', inplace=True)

In [31]:
tmdb_df[tmdb_df['imdb_id']=='0']

     imdb_id  budget  revenue certification
1249       0     NaN      NaN           NaN

In [32]:
tmdb_df.drop(1249, axis='index', inplace=True)

In [33]:
tmdb_df[tmdb_df['imdb_id'] == '0']

Empty DataFrame
Columns: [imdb_id, budget, revenue, certification]
Index: []

In [34]:
tmdb_df.reset_index(drop=True).head()

     imdb_id      budget     revenue certification
0  tt0113026  10000000.0         0.0           NaN
1  tt0113092         0.0         0.0           NaN
2  tt0116391         0.0         0.0           NaN
3  tt0118694    150000.0  14204632.0            PG
4  tt0118852         0.0         0.0             R

## Normalizing

### Basics

In [7]:
## create a col with a list of genres
basics_df['genres_split'] = basics_df['genres'].str.split(',')
basics_df

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0043139,Life of a Beijing Policeman,2013.0,NaN,120,"Drama,History","[Drama, History]"
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70,Drama,[Drama]
3,tt0069049,The Other Side of the Wind,2018.0,NaN,122,Drama,[Drama]
4,tt0088751,The Naked Monster,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
...,...,...,...,...,...,...,...
81824,tt9914942,Life Without Sara Amat,2019.0,NaN,74,Drama,[Drama]
81825,tt9915872,The Last White Witch,2019.0,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
81826,tt9916170,The Rehearsal,2019.0,NaN,51,Drama,[Drama]
81827,tt9916190,Safeguard,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
81828,tt9916362,Coven,2020.0,NaN,92,"Drama,History","[Drama, History]"

In [35]:
exploded_genres = basics_df.explode('genres_split')
exploded_genres

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0043139,Life of a Beijing Policeman,2013.0,NaN,120,"Drama,History",Drama
1,tt0043139,Life of a Beijing Policeman,2013.0,NaN,120,"Drama,History",History
...,...,...,...,...,...,...,...
81827,tt9916190,Safeguard,2020.0,NaN,95,"Action,Adventure,Thriller",Action
81827,tt9916190,Safeguard,2020.0,NaN,95,"Action,Adventure,Thriller",Adventure
81827,tt9916190,Safeguard,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
81828,tt9916362,Coven,2020.0,NaN,92,"Drama,History",Drama
81828,tt9916362,Coven,2020.0,NaN,92,"Drama,History",History

In [37]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

### Save title_genres as df to use as Table

In [11]:
# save just tconst and genres_split as new df
title_genres_df = exploded_genres[['tconst','genres_split']].copy()
title_genres_df.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0043139        Drama
1  tt0043139      History

### Create dictionary for Genre

In [12]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_id_map = dict(zip(unique_genres, genre_ints))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [13]:
## make new integer genre_id and drop string genres
title_genres_df['genre_id'] = title_genres_df['genres_split'].map(genre_id_map)
title_genres_df.head()

      tconst genres_split  genre_id
0  tt0035423       Comedy         5
0  tt0035423      Fantasy         9
0  tt0035423      Romance        18
1  tt0043139        Drama         7
1  tt0043139      History        11

In [14]:
# drop the genres split column
title_genres_df = title_genres_df.drop(columns= 'genres_split')

In [15]:
title_genres_df.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0043139         7
1  tt0043139        11

In [16]:
# Manually make dataframe with names cols from the .keyd and .values
genre_lookup = pd.DataFrame({'genre_name':genre_id_map.keys(),
                            'genre_id':genre_id_map.values()})
genre_lookup.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## Save tables to MySQL

In [17]:
with open('/Users/Evan/.secret/mysql.json') as f:
    login = json.load(f)
## Display the keys of the loaded dict
login.keys()

dict_keys(['username', 'password'])

In [46]:
# Create a connection string using credentials following this format:
# connection = "dialect+driver://username:password@host:port/database"
database_name = "movies"
connection_str = f"mysql+pymysql://{login['username']}:{login['password']}@localhost/{database_name}"

In [47]:
# Create an instance of the sqlalchemy Engine Class 
engine = create_engine(connection_str)

In [48]:
create_database(connection_str)

## Create SQL Tables

### title_basics SQL

In [43]:
basics_df.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0043139,Life of a Beijing Policeman,2013.0,NaN,120,"Drama,History","[Drama, History]"
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70,Drama,[Drama]
3,tt0069049,The Other Side of the Wind,2018.0,NaN,122,Drama,[Drama]
4,tt0088751,The Naked Monster,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"

In [41]:
basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81829 entries, 0 to 81828
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81829 non-null  object
 1   primaryTitle    81829 non-null  object
 2   startYear       81829 non-null  float64
 3   endYear         0 non-null      float64
 4   runtimeMinutes  81829 non-null  int64
 5   genres          81829 non-null  object
 6   genres_split    81829 non-null  object
dtypes: float64(2), int64(1), object(4)
memory usage: 4.4+ MB

In [50]:
basics_df = basics_df[['tconst', 'primaryTitle', 'startYear', 'endYear', 'runtimeMinutes']]
basics_df.head(2)

      tconst                 primaryTitle  startYear  endYear  runtimeMinutes
0  tt0035423               Kate & Leopold     2001.0      NaN             118
1  tt0043139  Life of a Beijing Policeman     2013.0      NaN             120

In [52]:
# Calculate max string lengths for object columns
key_len = basics_df['tconst'].fillna('').map(len).max()
title_len = basics_df['primaryTitle'].fillna('').map(len).max()
# Create a schema dictonary using Sqlalchemy datatype objects
basics_df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [53]:
# Save to sql with dtype and index=False
basics_df.to_sql('title_basics',engine,
                 dtype = basics_df_schema,
                 if_exists='replace',index=False)

81829

In [54]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [ ]:
data = genre_id_map
genres = pd.DataFrame(data.items(), columns = ['genre_name', 'genre_id'])
genres.head()

In [56]:
q_basics = """

SELECT *
FROM title_basics
LIMIT 10;

"""

pd.read_sql(q_basics, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0043139,Life of a Beijing Policeman,2013.0,None,120
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
3,tt0069049,The Other Side of the Wind,2018.0,None,122
4,tt0088751,The Naked Monster,2005.0,None,100
5,tt0096056,Crime and Punishment,2002.0,None,126
6,tt0100275,The Wandering Soap Opera,2017.0,None,80
7,tt0103340,Life for Life: Maximilian Kolbe,2006.0,None,90
8,tt0108549,West from North Goes South,2004.0,None,96
9,tt0113026,The Fantasticks,2000.0,None,86

### title_ratings

In [57]:
ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 502484 entries, 0 to 502483
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         502484 non-null  object
 1   averageRating  502484 non-null  float64
 2   numVotes       502484 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.5+ MB

In [58]:
## Calculate max string lengths for object columns
key_len = ratings_df['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
ratings_df_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [60]:
# Save to sql with dtype and index=False
ratings_df.to_sql('title_ratings',
                 engine,
                 dtype=ratings_df_schema,
                 if_exists='replace', index=False)

502484

In [61]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [62]:
q_ratings = """

SELECT *
FROM title_ratings
LIMIT 10;

"""

pd.read_sql(q_ratings, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1982
1  tt0000002            5.8       265
2  tt0000005            6.2      2624
3  tt0000006            5.1       182
4  tt0000007            5.4       821
5  tt0000008            5.4      2118
6  tt0000009            5.3       206
7  tt0000010            6.9      7199
8  tt0000012            7.4     12319
9  tt0000013            5.7      1894

### title_genres

In [63]:
title_genres_df.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0043139         7
1  tt0043139        11

In [64]:
# Calculate max string lengths for object columns
key_len = title_genres_df['tconst'].fillna('').map(len).max()
# Create a schema dictonary using Sqlalchemy datatype objects
title_genres_df_schema = {
    "tconst": String(key_len+1), 
    "genre_id": Integer()}

In [65]:
# Save to sql with dtype and index=False
title_genres_df.to_sql('title_genres',
                 engine,
                 dtype=title_genres_df_schema,
                 if_exists='replace', index=False)

153331

In [66]:
q_title_genres = """

SELECT *
FROM title_genres
LIMIT 10;

"""

pd.read_sql(q_title_genres, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0043139         7
4  tt0043139        11
5  tt0062336         7
6  tt0069049         7
7  tt0088751         5
8  tt0088751        12
9  tt0088751        19

In [69]:
# Save to sql with dtype and index=False
genre_lookup.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   genre_name  25 non-null     object
 1   genre_id    25 non-null     int64
dtypes: int64(1), object(1)
memory usage: 528.0+ bytes

In [70]:
genre_lookup.head(2)

  genre_name  genre_id
0     Action         0
1      Adult         1

In [71]:
## Calculate max string lengths for object columns
text_len = genre_lookup['genre_name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
genres_df_schema = {
    'genre_id':Integer(),
    "genre_name": Text(key_len+1)
    }

In [72]:
# Save to sql with dtype and index=False
genre_lookup.to_sql('genres',
                 engine,
                 dtype=genres_df_schema,
                 if_exists='replace', index=False)

25

In [73]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [74]:
q_genres = """

SELECT *
FROM genres
LIMIT 10;

"""

pd.read_sql(q_genres, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4
5     Comedy         5
6      Crime         6
7      Drama         7
8     Family         8
9    Fantasy         9

### tmdb data

In [75]:
tmdb_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2588 entries, 1 to 2589
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2588 non-null   object
 1   budget         2588 non-null   float64
 2   revenue        2588 non-null   float64
 3   certification  813 non-null    object
dtypes: float64(2), object(2)
memory usage: 101.1+ KB

In [76]:
## Calculate max string lengths for object columns
key_len = tmdb_df['imdb_id'].fillna('').map(len).max()
title_len = tmdb_df['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
tmdb_df_schema = {
    "imdb_id": String(key_len+1), 
    "certification": Text(title_len+1),
    'budget':Float(),
    'revenue':Float()}

In [77]:
# Save to sql with dtype and index=False
tmdb_df.to_sql('tmdb_data',
                 engine,
                 dtype=tmdb_df_schema,
                 if_exists='replace', index=False)

2588

In [78]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [79]:
q_tmdb = """

SELECT *
FROM tmdb_data
LIMIT 10;

"""

pd.read_sql(q_tmdb, engine)

     imdb_id      budget     revenue certification
0  tt0035423  48000000.0  76019000.0         PG-13
1  tt0113026  10000000.0         0.0          None
2  tt0113092         0.0         0.0          None
3  tt0114447         0.0         0.0          None
4  tt0116391         0.0         0.0          None
5  tt0116916         0.0         0.0            PG
6  tt0118589  22000000.0   5271670.0         PG-13
7  tt0118652   1000000.0         0.0             R
8  tt0118694    150000.0  14204600.0            PG
9  tt0118852         0.0         0.0             R

## Show Tables

In [80]:
q = """

SHOW TABLES;

"""

pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data